README.org
#+TITLE: Proyecto GUI MatLab - Grupo 6
#+AUTHOR: Grupo 6
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Interfaz grafica en MatLab

** Main

Script que usamos para correr la gui inicialmente. Define algunos valores por defecto y llama al
menu de elección.

#+begin_src octave :results output :tangle main.m
  set(0, 'defaultlinelinewidth', 2);
  set (0, 'defaulttextfontname', 'TimesNewRoman')
  set (0, 'defaulttextfontsize', 20)
  set (0, 'DefaultAxesFontName', 'TimesNewRoman')
  set(0, 'DefaultAxesFontSize', 20)

  clear h

  h = guidata (gcf);
  menu_eleccion (gcf, true);
  set (gcf, 'color', get(0, 'defaultuicontrolbackgroundcolor'))
  set (gcf, 'name', 'Menu Inicio')
  set (gcf, 'numbertitle', 'off')
  set (gcf, 'toolbar', 'none')
  set (gcf, 'menubar', 'none')

#+end_src

