README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-26 Sun 16:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Proyecto GUI MatLab - Grupo 6</title>
<meta name="author" content="Grupo 6" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Proyecto GUI MatLab - Grupo 6</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7d50c9c">1. Interfaz grafica en MatLab</a>
<ul>
<li><a href="#org0ffe554">1.1. Main</a></li>
<li><a href="#orgea8624c">1.2. Menu eleccion</a></li>
<li><a href="#orgf5a563d">1.3. Menu grafica</a></li>
<li><a href="#org8c90b78">1.4. Mensaje de error</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7d50c9c" class="outline-2">
<h2 id="org7d50c9c"><span class="section-number-2">1.</span> Interfaz grafica en MatLab</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0ffe554" class="outline-3">
<h3 id="org0ffe554"><span class="section-number-3">1.1.</span> Main</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Script que usamos para correr la gui inicialmente. Define algunos valores por defecto y llama al
menu de elección.
</p>

<div class="org-src-container">
<pre class="src src-octave">set(0<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'defaultlinelinewidth'</span><span style="color: #8f0075;">,</span> 2)<span style="color: #8f0075;">;</span>
set (0<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'defaulttextfontname'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'TimesNewRoman'</span>)
set (0<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'defaulttextfontsize'</span><span style="color: #8f0075;">,</span> 20)
set (0<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'DefaultAxesFontName'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'TimesNewRoman'</span>)
set(0<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'DefaultAxesFontSize'</span><span style="color: #8f0075;">,</span> 20)

clear h

h <span style="color: #8f0075;">=</span> guidata (gcf)<span style="color: #8f0075;">;</span>
menu_eleccion (gcf<span style="color: #8f0075;">,</span> true)<span style="color: #8f0075;">;</span>
set (gcf<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'color'</span><span style="color: #8f0075;">,</span> get(0<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'defaultuicontrolbackgroundcolor'</span>))
set (gcf<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'name'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'Menu Inicio'</span>)
set (gcf<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'numbertitle'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'off'</span>)
set (gcf<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'toolbar'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'none'</span>)
set (gcf<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'menubar'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'none'</span>)

</pre>
</div>
</div>
</div>
