README.html

<div id="outline-container-orgea8624c" class="outline-3">
<h3 id="orgea8624c"><span class="section-number-3">1.2.</span> Menu eleccion</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Menu que permite elegir que funcionalidad del programa usaremos. Actualmente solo implementada la
opción de Graficar funciones.
</p>

<div class="org-src-container">
<pre class="src src-octave">
<span style="color: #531ab6;">function</span> <span style="color: #721045;">menu_eleccion</span>(obj<span style="color: #8f0075;">,</span> init)
  clear h

  h <span style="color: #8f0075;">=</span> guidata(obj)<span style="color: #8f0075;">;</span>

  <span style="color: #7f0000; font-style: italic;">%% Grupo e Integrantes</span>
  h.grupo <span style="color: #8f0075;">=</span> uicontrol(<span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'text'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'Grupo 6'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span><span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span>[0.55 0.75 0.4 0.045])<span style="color: #8f0075;">;</span>
  h.integrantes <span style="color: #8f0075;">=</span> uicontrol(<span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'text'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'Integrantes:'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span><span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span>[0.55 0.7 0.4 0.045])<span style="color: #8f0075;">;</span>
  h.int1 <span style="color: #8f0075;">=</span> uicontrol(<span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'text'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'- Gonzales Morales Beckham Luis'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span><span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span>[0.55 0.65 0.4 0.045])<span style="color: #8f0075;">;</span>
  h.int2 <span style="color: #8f0075;">=</span> uicontrol(<span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'text'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'- Moran Aragon Lucia Camila'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span><span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span>[0.55 0.6 0.4 0.045])<span style="color: #8f0075;">;</span>
  h.int3 <span style="color: #8f0075;">=</span> uicontrol(<span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'text'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'- Pozo Velarde Luis Felipe'</span><span style="color: #8f0075;">,</span>
                      <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span><span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span>[0.55 0.55 0.4 0.045])<span style="color: #8f0075;">;</span>
  h.int4 <span style="color: #8f0075;">=</span> uicontrol(<span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'text'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'- Ramirez Chero Alejandro David'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span><span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span>[0.55 0.5 0.4 0.045])<span style="color: #8f0075;">;</span>
  h.int5 <span style="color: #8f0075;">=</span> uicontrol(<span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'text'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'- Saico Merma Cristhian Daniel'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span><span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span>[0.55 0.45 0.4 0.045])<span style="color: #8f0075;">;</span>
  h.int6 <span style="color: #8f0075;">=</span> uicontrol(<span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'text'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'- Vega Astocondor Diego Alonso'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span><span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                      <span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span>[0.55 0.4 0.4 0.045])<span style="color: #8f0075;">;</span>


  <span style="color: #7f0000; font-style: italic;">%% Botones</span>
  h.titulo <span style="color: #8f0075;">=</span> uicontrol (<span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'text'</span><span style="color: #8f0075;">,...</span>
                        <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                        <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'Elija una opcion'</span><span style="color: #8f0075;">,...</span>
                        <span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span> [0.05 0.8 0.5 0.09])<span style="color: #8f0075;">;</span>

  h.boton_grafica <span style="color: #8f0075;">=</span> uicontrol (<span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'pushbutton'</span><span style="color: #8f0075;">,...</span>
                               <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                               <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'Grafica de funciones'</span><span style="color: #8f0075;">,...</span>
                               <span style="color: #3548cf;">'callback'</span><span style="color: #8f0075;">,</span> @menu_grafica<span style="color: #8f0075;">,...</span>
                               <span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span> [0.05 0.7 0.5 0.09])<span style="color: #8f0075;">;</span>

  h.boton_curvas <span style="color: #8f0075;">=</span> uicontrol (<span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'pushbutton'</span><span style="color: #8f0075;">,...</span>
                              <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                              <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'Curvas de Bezier'</span><span style="color: #8f0075;">,...</span>
                              <span style="color: #3548cf;">'callback'</span><span style="color: #8f0075;">,</span> @actualizar_plot<span style="color: #8f0075;">,...</span>
                              <span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span> [0.05 0.6 0.5 0.09])<span style="color: #8f0075;">;</span>

  <span style="color: #7f0000; font-style: italic;">% Si necesitan a&#241;adir nuevos botones copien un boton de arriba y reduzcan en</span>
  <span style="color: #7f0000; font-style: italic;">% 0.1 el segundo elemento del vector posicion, en string poner una</span>
  <span style="color: #7f0000; font-style: italic;">% descripcion de su menu y en callback el nombre de su funcion con un arroba</span>
  <span style="color: #7f0000; font-style: italic;">% al inicio.</span>

<span style="color: #531ab6;">end</span> 

</pre>
</div>
</div>
</div>
