README.html

<div id="outline-container-orgf5a563d" class="outline-3">
<h3 id="orgf5a563d"><span class="section-number-3">1.3.</span> Menu grafica</h3>
<div class="outline-text-3" id="text-1-3">
<p>
El menu de grafico de funciones y sus respectivas derivadas.
</p>

<div class="org-src-container">
<pre class="src src-octave"><span style="color: #531ab6;">function</span> <span style="color: #721045;">menu_grafica</span> (obj<span style="color: #8f0075;">,</span> init)

  pkg load symbolic<span style="color: #8f0075;">;</span>

  h.main_frame <span style="color: #8f0075;">=</span> figure(<span style="color: #3548cf;">'name'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'Menu grafica'</span><span style="color: #8f0075;">,</span><span style="color: #3548cf;">'numbertitle'</span><span style="color: #8f0075;">,</span><span style="color: #3548cf;">'off'</span>)<span style="color: #8f0075;">;</span>

  h.label_derivada <span style="color: #8f0075;">=</span> uicontrol (h.main_frame<span style="color: #8f0075;">,</span><span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'text'</span><span style="color: #8f0075;">,...</span>
                                <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                                <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'Funcion'</span><span style="color: #8f0075;">,...</span>
                                <span style="color: #3548cf;">'Position'</span><span style="color: #8f0075;">,</span> [0.05 0.9 0.2 0.09])<span style="color: #8f0075;">;</span>

  h.funcion <span style="color: #8f0075;">=</span> uicontrol(h.main_frame<span style="color: #8f0075;">,</span><span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'edit'</span><span style="color: #8f0075;">,...</span>
                        <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                        <span style="color: #3548cf;">'Position'</span><span style="color: #8f0075;">,</span> [0.05 0.8 0.2 0.09])<span style="color: #8f0075;">;</span>


  h.graficar_funcion <span style="color: #8f0075;">=</span> uicontrol (h.main_frame<span style="color: #8f0075;">,</span><span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'pushbutton'</span><span style="color: #8f0075;">,...</span>
                                  <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                                  <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'Graficar'</span><span style="color: #8f0075;">,...</span>
                                  <span style="color: #3548cf;">'callback'</span><span style="color: #8f0075;">,</span> {@actualizar_plot}<span style="color: #8f0075;">,...</span>
                                  <span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span> [0.05 0.7 0.2 0.09])<span style="color: #8f0075;">;</span>

  h.label_derivada <span style="color: #8f0075;">=</span> uicontrol (h.main_frame<span style="color: #8f0075;">,</span><span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'text'</span><span style="color: #8f0075;">,...</span>
                                <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                                <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'Orden derivacion'</span><span style="color: #8f0075;">,...</span>
                                <span style="color: #3548cf;">'Position'</span><span style="color: #8f0075;">,</span> [0.05 0.6 0.2 0.09])<span style="color: #8f0075;">;</span>

  h.grado_derivada <span style="color: #8f0075;">=</span> uicontrol(h.main_frame<span style="color: #8f0075;">,</span><span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'edit'</span><span style="color: #8f0075;">,...</span>
                               <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                               <span style="color: #3548cf;">'value'</span><span style="color: #8f0075;">,</span> 0<span style="color: #8f0075;">,...</span>
                               <span style="color: #3548cf;">'Position'</span><span style="color: #8f0075;">,</span> [0.05 0.5 0.2 0.09])<span style="color: #8f0075;">;</span>


  h.label_intervalo <span style="color: #8f0075;">=</span> uicontrol (h.main_frame<span style="color: #8f0075;">,</span><span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'text'</span><span style="color: #8f0075;">,...</span>
                                 <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                                 <span style="color: #3548cf;">'string'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'Intervalo'</span><span style="color: #8f0075;">,...</span>
                                 <span style="color: #3548cf;">'Position'</span><span style="color: #8f0075;">,</span> [0.05 0.4 0.2 0.09])<span style="color: #8f0075;">;</span>

  h.intervalo1 <span style="color: #8f0075;">=</span> uicontrol(h.main_frame<span style="color: #8f0075;">,</span><span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'edit'</span><span style="color: #8f0075;">,...</span>
                           <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                           <span style="color: #3548cf;">'value'</span><span style="color: #8f0075;">,</span> <span style="color: #8f0075;">-</span>2<span style="color: #8f0075;">,...</span>
                           <span style="color: #3548cf;">'Position'</span><span style="color: #8f0075;">,</span> [0.05 0.3 0.1 0.09])<span style="color: #8f0075;">;</span>

  h.intervalo2 <span style="color: #8f0075;">=</span> uicontrol(h.main_frame<span style="color: #8f0075;">,</span><span style="color: #3548cf;">'style'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'edit'</span><span style="color: #8f0075;">,...</span>
                           <span style="color: #3548cf;">'units'</span><span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'normalized'</span><span style="color: #8f0075;">,...</span>
                           <span style="color: #3548cf;">'value'</span><span style="color: #8f0075;">,</span>2<span style="color: #8f0075;">,...</span>
                           <span style="color: #3548cf;">'Position'</span><span style="color: #8f0075;">,</span> [0.15 0.3 0.1 0.09])<span style="color: #8f0075;">;</span>

  h.ejes <span style="color: #8f0075;">=</span> axes (<span style="color: #3548cf;">'position'</span><span style="color: #8f0075;">,</span> [0.5 0.2 0.4 0.7])<span style="color: #8f0075;">;</span>

  guidata(h.main_frame<span style="color: #8f0075;">,</span> h)

  set (gcf<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'color'</span><span style="color: #8f0075;">,</span> get(0<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'defaultuicontrolbackgroundcolor'</span>))

  <span style="color: #531ab6;">function</span> <span style="color: #721045;">actualizar_plot</span> (obj<span style="color: #8f0075;">,</span> init)
    h <span style="color: #8f0075;">=</span> guidata(obj)<span style="color: #8f0075;">;</span>

    syms x
    y <span style="color: #8f0075;">=</span>  get(h.funcion<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'String'</span>)<span style="color: #8f0075;">;</span>

    <span style="color: #531ab6;">if</span> (isempty(y))
      yy <span style="color: #8f0075;">=</span> sym(<span style="color: #3548cf;">'x^3'</span>)<span style="color: #8f0075;">;</span>
    <span style="color: #531ab6;">else</span>
      yy <span style="color: #8f0075;">=</span> sym(y)<span style="color: #8f0075;">;</span>
    <span style="color: #531ab6;">end</span>

    der_fixer <span style="color: #8f0075;">=</span> 1<span style="color: #8f0075;">;</span>

    grado <span style="color: #8f0075;">=</span> 0 <span style="color: #8f0075;">+</span> 1<span style="color: #8f0075;">*</span>str2num(get(h.grado_derivada<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'String'</span>))<span style="color: #8f0075;">;</span>

    int_inicio <span style="color: #8f0075;">=</span>  str2num(get(h.intervalo1<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'String'</span>))<span style="color: #8f0075;">;</span>
    int_fin <span style="color: #8f0075;">=</span>  str2num(get(h.intervalo2<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'String'</span>))<span style="color: #8f0075;">;</span>

    <span style="color: #531ab6;">if</span> (isempty(int_inicio))
      int_inicio <span style="color: #8f0075;">=</span> get(h.intervalo1<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'value'</span>)<span style="color: #8f0075;">;</span>
    <span style="color: #531ab6;">end</span>

    <span style="color: #531ab6;">if</span> (isempty(int_fin))
      int_fin <span style="color: #8f0075;">=</span> get(h.intervalo2<span style="color: #8f0075;">,</span> <span style="color: #3548cf;">'value'</span>)<span style="color: #8f0075;">;</span>
    <span style="color: #531ab6;">end</span>

    <span style="color: #531ab6;">if</span> (int_inicio <span style="color: #8f0075;">&gt;</span> int_fin)
      [int_inicio int_fin] <span style="color: #8f0075;">=</span> deal(int_fin<span style="color: #8f0075;">,</span> int_inicio)<span style="color: #8f0075;">;</span>
    <span style="color: #531ab6;">end</span> 

    <span style="color: #531ab6;">if</span> (isempty(grado))
      grado <span style="color: #8f0075;">=</span> 0<span style="color: #8f0075;">;</span>
    <span style="color: #531ab6;">end</span>

    dy <span style="color: #8f0075;">=</span> diff(yy<span style="color: #8f0075;">,</span>x<span style="color: #8f0075;">,</span>grado)<span style="color: #8f0075;">;</span>

    <span style="color: #531ab6;">if</span> (isallconstant(dy))
      mensaje_error(<span style="color: #3548cf;">'La funcion no acepta ese orden de derivacion'</span>)
      <span style="color: #531ab6;">while</span> (isallconstant(dy))
        dy <span style="color: #8f0075;">=</span> diff(yy<span style="color: #8f0075;">,</span>x<span style="color: #8f0075;">,</span>grado <span style="color: #8f0075;">-</span> der_fixer)<span style="color: #8f0075;">;</span>
        der_fixer <span style="color: #8f0075;">=</span> der_fixer <span style="color: #8f0075;">+</span> 1<span style="color: #8f0075;">;</span>
      <span style="color: #531ab6;">end</span>
    <span style="color: #531ab6;">end</span>
    h.grafica <span style="color: #8f0075;">=</span> ezplot(dy<span style="color: #8f0075;">,</span> [int_inicio int_fin])<span style="color: #8f0075;">;</span>
    guidata (obj<span style="color: #8f0075;">,</span> h)<span style="color: #8f0075;">;</span>
  <span style="color: #531ab6;">end</span>

<span style="color: #531ab6;">end</span> 

</pre>
</div>
</div>
</div>
